n5/src/Catalogs/CarTypes/CarTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CarTypes</name>
  <attributes>
    <name>AdditionalEquipmentSummer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalEquipmentWinter</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Carrying</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineSummerAvg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineSummerMax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineSummerMin</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineWinterAvg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineWinterMax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineWinterMin</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EquipmentSummer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EquipmentWinter</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FuelEquipment</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelHours</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelMain</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelOther</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>MovementsSummer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MovementsWinter</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OdometerSummer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OdometerSummerCity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OdometerWinter</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OdometerWinterCity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OtherSummer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OtherWinter</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TankCapacity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TankCapacityAdditional</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrailerSummer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrailerWinter</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransportWorkSummer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransportWorkWinter</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.CarTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>YearMade</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Trailers</name>
    <attributes>
      <name>Category</name>
      <type>
        <types>EnumRef.FuelConsumptionCategory</types>
      </type>
    </attributes>
    <attributes>
      <name>Summer</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Trailer</name>
      <type>
        <types>CatalogRef.CarTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Winter</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WorkTypes</name>
    <attributes>
      <name>Work</name>
      <type>
        <types>EnumRef.CarWorkTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Enums/CarTypes/CarTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CarTypes</name>
  <enumValues>
    <name>Bus</name>
  </enumValues>
  <enumValues>
    <name>Heavy</name>
  </enumValues>
  <enumValues>
    <name>PassengerCar</name>
  </enumValues>
  <enumValues>
    <name>Rent</name>
  </enumValues>
  <enumValues>
    <name>Special</name>
  </enumValues>
  <enumValues>
    <name>Trailer</name>
  </enumValues>
  <enumValues>
    <name>Truck</name>
  </enumValues>
  <enumValues>
    <name>SpecialCar1Group</name>
  </enumValues>
  <enumValues>
    <name>SpecialCar2Group</name>
  </enumValues>
  <enumValues>
    <name>TipTruck</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/CarTypes/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|OdometerSummerCity OdometerWinterCity show inlist ( Object.Type, Enum.CarTypes.PassengerCar, Enum.CarTypes.Rent )
	|;
	|PageTrailers show Object.Type = Enum.CarTypes.Truck
	|;
	|GroupOdometer show inlist ( Object.Type, Enum.CarTypes.Bus, Enum.CarTypes.Heavy, Enum.CarTypes.PassengerCar, Enum.CarTypes.Rent, Enum.CarTypes.Special, Enum.CarTypes.Truck )
	|;
	|GroupEngineHours show inlist ( Object.Type, Enum.CarTypes.Heavy, Enum.CarTypes.Special )
	|;
	|GroupEquipment show inlist ( Object.Type, Enum.CarTypes.Heavy, Enum.CarTypes.Special, Enum.CarTypes.Truck )
	|;
	|GroupOther show inlist ( Object.Type, Enum.CarTypes.Bus, Enum.CarTypes.Heavy, Enum.CarTypes.PassengerCar, Enum.CarTypes.Rent, Enum.CarTypes.Special, Enum.CarTypes.Truck )
	|;
	|GroupAdditionalEquipments show inlist ( Object.Type, Enum.CarTypes.Bus, Enum.CarTypes.Heavy, Enum.CarTypes.PassengerCar, Enum.CarTypes.Rent, Enum.CarTypes.Special, Enum.CarTypes.Truck )
	|;
	|GroupTrailer show Object.Type = Enum.CarTypes.Truck
	|;
	|GroupTransportWork GroupTransportMovements show inlist ( Object.Type, Enum.CarTypes.Truck )
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure CarTypeOnChange ( Item )
	
	applyCarType ();
	
EndProcedure

&AtServer
Procedure applyCarType ()
	
	type = Object.Type;
	carTypes = Enums.CarTypes;
	if ( type <> carTypes.PassengerCar
		and type <> carTypes.Rent ) then
		Object.OdometerSummerCity = 0;
		Object.OdometerWinterCity = 0;
	endif; 
	Appearance.Apply ( ThisObject, "Object.Type" );
	
EndProcedure
